<?php

namespace Indeev\Asciify;

class Asciify
{
    public static function convert(string $str): string
    {
        $letterVariants = [
            'a' => ['á','â','à','ă','ȃ','ả','a̋','ȁ','ǎ','ā','a̍','ȧ','å','a̐','ã','ä','a̓','ⱥ','a̭','a̧','a̱','ą','ạ','ḁ','a̰','a̲','a̤','ấ','ầ','ẩ','ẫ','ắ','ằ','ẳ','ẵ','ā́','ā̀','ā̂','ā̌','ā̊','ǡ','ǻ','ã́','ã̀','ã̂','ã̌','ã̍','ä́','ä̀','ä̂','ä̌','ǟ','ä̃','á̧','à̧','â̧','ǎ̧','á̱','à̱','â̱','ā̱','ā̱́','ā̱̀','ā̱̂','å̱','ä̱','ạ́','ạ̀','ậ','ặ','ạ̄','ạ̃','ạ̈','ą́','ą̀','ą̂','ą̌','ą̄','ą̄́','ą̄̀','ą̄̂','ą̄̌','ą̊','ą̃','ą̈','ą̈̀','ą̈̂','ą̈̌','á̤','à̤','â̤','ă̤','ā̤','a̤̍'],
            'A' => ['Á','Â','À','Ă','Ȃ','Ả','A̋','Ȁ','Ǎ','Ā','A̍','Ȧ','Å','A̐','Ã','Ä','A̓','Ⱥ','A̭','A̧','A̱','Ą','Ạ','Ḁ','A̰','A̲','A̤','Ấ','Ầ','Ẩ','Ẫ','Ắ','Ằ','Ẳ','Ẵ','Ā́','Ā̀','Ā̂','Ā̌','Ā̊','Ǡ','Ǻ','Ã́','Ã̀','Ã̂','Ã̌','Ã̍','Ä́','Ä̀','Ä̂','Ä̌','Ǟ','Ä̃','Á̧','À̧','Â̧','Ǎ̧','Á̱','À̱','Â̱','Ā̱','Ā̱́','Ā̱̀','Ā̱̂','Å̱','Ä̱','Ạ́','Ạ̀','Ậ','Ặ','Ạ̄','Ạ̃','Ạ̈','Ą́','Ą̀','Ą̂','Ą̌','Ą̄','Ą̄́','Ą̄̀','Ą̄̂','Ą̄̌','Ą̊','Ą̃','Ą̈','Ą̈̀','Ą̈̂','Ą̈̌','Á̤','À̤','Â̤','Ă̤','Ā̤','A̤̍'],
            'b' => ['b́','b̀','ɓ','b̄','ḃ','b̈','b̃','b̓','ƀ','b̯','ḇ','ḅ','b̤','ꞗ'],
            'B' => ['B́','B̀','Ɓ','B̄','Ḃ','B̈','B̃','B̓','Ƀ','B̯','Ḇ','Ḅ','B̤','Ꞗ'],
            'c' => ['ć','ĉ','c̀','c̆','ƈ','č','c̄','ċ','c̃','c̈','c̓','ȼ','ç','c̱','c̣','c̦','ḉ','ç̆','ç̌','ç̇','ć̣','č̣','č̈','č̓','ꞓ'],
            'C' => ['Ć','Ĉ','C̀','C̆','Ƈ','Č','C̄','Ċ','C̃','C̈','C̓','Ȼ','Ç','C̱','C̣','C̦','Ḉ','Ç̆','Ç̌','Ç̇','Ć̣','Č̣','Č̈','Č̓','Ꞓ'],
            'd' => ['d́','d̂','ɗ','ď','d̄','ḋ','d̓','đ','ḓ','ɖ','ḑ','ḏ','ḍ','d̤','d̦','ḏ̣','ḍ̄','đ̣','ð'],
            'D' => ['D́','D̂','Ɗ','Ď','D̄','Ḋ','D̓','Đ','Ḓ','Ɖ','Ḑ','Ḏ','Ḍ','D̤','D̦','Ḏ̣','Ḍ̄','Đ̣','Ð'],
            'e' => ['é','ê','è','ĕ','ȇ','e̛','ẻ','ȅ','ě','e̍','ē','ė','e̊','ẽ','ë','ɇ','ḙ','ȩ','ẹ','ę','ḛ','e̱','e̤','e̲','é̈','ế','ề','ê̆','ể','ê̌','ê̄','ễ','ȩ́','ȩ̀','ȩ̂','ȩ̌','ḝ','ḗ','ḕ','ē̂','ē̌','ė́','ė̄','ė̃','ẽ́','ẽ̀','ẽ̂','ẽ̌','ẽ̍','ë́','ë̀','ë̂','ë̌','ë̃','é̱','è̱','ê̱','ē̱','ḗ̱','ḕ̱','ē̱̂','ę́','ę̀','ę̂','ę̌','ę̄','ę̄́','ę̄̀','ę̄̂','ę̄̌','ę̃','ę̈','ę̈̀','ę̈̂','ę̈̌','ẹ́','ẹ̀','ệ','ẹ̌','ẹ̄','ẹ̃','é̤','è̤','ê̤','ĕ̤','ē̤','e̤̍'],
            'E' => ['É','Ê','È','Ĕ','Ȇ','E̛','Ẻ','Ȅ','Ě','E̍','Ē','Ė','E̊','Ẽ','Ë','Ɇ','Ḙ','Ȩ','Ẹ','Ę','Ḛ','E̱','E̤','E̲','É̈','Ế','Ề','Ê̆','Ể','Ê̌','Ê̄','Ễ','Ȩ́','Ȩ̀','Ȩ̂','Ȩ̌','Ḝ','Ḗ','Ḕ','Ē̂','Ē̌','Ė́','Ė̄','Ė̃','Ẽ́','Ẽ̀','Ẽ̂','Ẽ̌','Ẽ̍','Ë́','Ë̀','Ë̂','Ë̌','Ë̃','É̱','È̱','Ê̱','Ē̱','Ḗ̱','Ḕ̱','Ē̱̂','Ę́','Ę̀','Ę̂','Ę̌','Ę̄','Ę̄́','Ę̄̀','Ę̄̂','Ę̄̌','Ę̃','Ę̈','Ę̈̀','Ę̈̂','Ę̈̌','Ẹ́','Ẹ̀','Ệ','Ẹ̌','Ẹ̄','Ẹ̃','É̤','È̤','Ê̤','Ĕ̤','Ē̤','E̤̍'],
            'f' => ['f́','f̀','f̄','f̧','ḟ','ƒ'],
            'F' => ['F́','F̀','F̄','F̧','Ḟ','Ƒ'],
            'g' => ['ǵ','ĝ','g̀','ğ','ɠ','ǧ','ḡ','ġ','g̃','g̈','ģ','g̣','̤g̤','g̦','ǧ̈','ǥ','ꞡ'],
            'G' => ['Ǵ','Ĝ','G̀','Ğ','Ɠ','Ǧ','Ḡ','Ġ','G̃','G̈','Ģ','G̣','G','G̦','Ǧ̈','Ǥ','Ꞡ'],
            'h' => ['h́','ĥ','ȟ','h̄','ḣ','h̐','ḧ','h̓','ħ','ḫ','h̭','ḩ','ẖ','ḥ','h̤','h̦','ⱨ','ɦ'],
            'H' => ['H́','Ĥ','Ȟ','H̄','Ḣ','H̐','Ḧ','H̓','Ħ','Ḫ','H̭','Ḩ','H̱','Ḥ','H̤','H̦','Ⱨ','Ɦ'],
            'i' => ['í','î','ì','ǐ','ĭ','ȋ','ỉ','i̋','ȉ','i̍','ī','i','ı','i̊','i̐','ĩ','ï','i̓','ɨ','i̭','i̧','i̱','į','ị','ḭ','î́','ɨ́','ɨ̀','̂ɨ̂','ɨ̌','ɨ̃','ɨ̈','ɨ̄','ɨ̧','ɨ̧̀','ɨ̧̂','ɨ̧̌','ī́','ī̀','ī̂','ī̌','ĩ́','ĩ̀','ĩ̂','ĩ̌','ĩ̍','ḯ','í̧','ì̧','î̧','í̱','ì̱','î̱','ī̱','ī̱́','ī̱̀','ī̱̂','į́','į̀','į̂','į̌','į̃','ị́','ị̂','ị̃'],
            'I' => ['Í','Î','Ì','Ǐ','Ĭ','Ȋ','Ỉ','I̋','Ȉ','I̍','Ī','İ','I','I̊','I̐','Ĩ','Ï','I̓','Ɨ','I̭','I̧','I̱','Į','Ị','Ḭ','Î́','Ɨ́','Ɨ̀','Ɨ','Ɨ̌','Ɨ̃','Ɨ̈','Ɨ̄','Ɨ̧','Ɨ̧̀','Ɨ̧̂','Ɨ̧̌','Ī́','Ī̀','Ī̂','Ī̌','Ĩ́','Ĩ̀','Ĩ̂','Ĩ̌','Ĩ̍','Ḯ','Í̧','Ì̧','Î̧','Í̱','Ì̱','Î̱','Ī̱','Ī̱́','Ī̱̀','Ī̱̂','Į́','Į̀','Į̂','Į̌','Į̃','Ị́','Ị̂','Ị̃'],
            'j' => ['j́','ĵ','ǰ','j̄','j̇','ȷ','j̃','j̈','ɉ','j̧','j̣','ǰ̣','ʝ'],
            'J' => ['J́','Ĵ','J̌','J̄','J̇','J','J̃','J̈','Ɉ','J̧','J̣','J̣̌','Ʝ'],
            'k' => ['ḱ','k̀','ǩ','ƙ','k̄','k̇','ķ','ḵ','ḳ','k̤','k̦','ḵ̓','ⱪ','ꝁ','ꝃ','ꝅ','ꞣ'],
            'K' => ['Ḱ','K̀','Ǩ','Ƙ','K̄','K̇','Ķ','Ḵ','Ḳ','K̤','K̦','Ḵ̓','Ⱪ','Ꝁ','Ꝃ','Ꝅ','Ꞣ'],
            'l' => ['ĺ','l̂','l̀','ľ','l̄','l̇','l̐','l̃','l̈','l̓','ƚ','ł','ḽ','l̮','ļ','ḻ','ḷ','l̥','l̤','l̦','l᷊','l̮̄','ḷ́','ḹ','ḷ̀','l̤̄','ḷ̓','ł̣','ĺ̥','l̥̀','l̥̄','ꝉ','ɫ','ɬ','ⱡ'],
            'L' => ['Ĺ','L̂','L̀','Ľ','L̄','L̇','L̐','L̃','L̈','L̓','Ƚ','Ł','Ḽ','L̮','Ļ','Ḻ','Ḷ','L̥','L̤','L̦','L᷊','L̮̄','Ḷ́','Ḹ','Ḷ̀','L̤̄','Ḷ̓','Ł̣','Ĺ̥','L̥̀','L̥̄','Ꝉ','Ɫ','Ɬ','Ⱡ'],
            'm' => ['ḿ','ṁ','ṃ','m̆','m̧','m̌','m̂','m̈','m̀','m̄','m̱','m̃','m̋','ɱ'],
            'M' => ['Ḿ','Ṁ','Ṃ','M̆','M̧','M̌','M̂','M̈','M̀','M̄','M̱','M̃','M̋','Ɱ'],
            'n' => ['ń','ň','ñ','ņ','ṅ','ṇ','ṉ','ṋ','n̆','n̈','ǹ','n̄','ɲ','ꞥ'],
            'N' => ['Ń','Ň','Ñ','Ņ','Ṅ','Ṇ','Ṉ','Ṋ','N̆','N̈','Ǹ','N̄','Ɲ','Ꞥ'],
            'o' => ['ó','ö','ő','ô','ơ','õ','ø','ò','ǒ','ō','ǫ','ọ','ỏ','ǿ','ṍ','ṏ','ṑ','ṓ','ố','ồ','ổ','ỗ','ộ','ớ','ờ','ở','ỡ','ợ','ó̩','ǫ́','ợ','ŏ','ō̂','ȫ','ǫ̈','o͘','ȱ','ø̂','ȍ','ò̩','ȏ','ǭ','ȭ','o̱','o̊','ō̊','ō̌','ɵ','ꝋ','œ'],
            'O' => ['Ó','Ö','Ő','Ô','Ơ','Õ','Ø','Ò','Ǒ','Ō','Ǫ','Ọ','Ỏ','Ǿ','Ṍ','Ṏ','Ṑ','Ṓ','Ố','Ồ','Ổ','Ỗ','Ộ','Ớ','Ờ','Ở','Ỡ','Ợ','Ó̩','Ǫ́','Ợ','Ŏ','Ō̂','Ȫ','Ǫ̈','O͘','Ȱ','Ø̂','Ȍ','Ò̩','Ȏ','Ǭ','Ȭ','O̱','O̊','Ō̊','Ō̌','Ɵ','Ꝋ','Œ'],
            'p' => ['ṕ','ṗ','p̆','p̌','p̂','p̈','p̣','p̄','p̱','p̃','ƥ','ᵽ','ꝑ','ꝕ','ꝓ'],
            'P' => ['Ṕ','Ṗ','P̆','P̌','P̂','P̈','P̣','P̄','P̱','P̃','Ƥ','Ᵽ','Ꝑ','Ꝕ','Ꝓ'],
            'q' => ['q̌','q̊','q̈','q̣̈','q̄','q̃','q́','q̇','q̣','q̣̇','q̧','ꝙ','ꝗ'],
            'Q' => ['Q̌','Q̊','Q̈','Q̣̈','Q̄','Q̃','Q́','Q̇','Q̣','Q̣̇','Q̧','Ꝙ','Ꝗ'],
            'r' => ['ŕ','ř','ŗ','ṙ','ṛ','ṟ','ṝ','ȑ','ɍ','ȓ','r̆','r̂','r̭','r̀','r̄','r̥','r̥̄','r̃','ɽ','ꞧ'],
            'R' => ['Ŕ','Ř','Ŗ','Ṙ','Ṛ','Ṟ','Ṝ','Ȑ','Ɍ','Ȓ','R̆','R̂','R̭','R̀','R̄','R̥','R̥̄','R̃','Ɽ','Ꞧ'],
            's' => ['ś','š','ş','ș','ŝ','ṡ','ṣ','ꞩ','ṥ','ṧ','s̈','ṡ̃','ṩ','s̀','s̄','s̱','s̊','s̥','ṣ̄','ȿ'],
            'S' => ['Ś','Š','Ş','Ș','Ŝ','Ṡ','Ṣ','Ꞩ','Ṥ','Ṧ','S̈','Ṡ̃','Ṩ','S̀','S̄','S̱','S̊','S̥','Ṣ̄','Ȿ'],
            't' => ['ť','ț','ţ','ŧ','ṫ','ṭ','ṯ','ṱ','ẗ','t́','t̆','t̂','t̄','t̀','ƭ','ʈ','ⱦ'],
            'T' => ['Ť','Ț','Ţ','Ŧ','Ṫ','Ṭ','Ṯ','Ṱ','T̈','T́','T̆','T̂','T̄','T̀','Ƭ','Ʈ','Ⱦ'],
            'u' => ['ú','ů','ù','ü','ű','ū','ų','û','ũ','ǔ','ŭ','ṳ','ṵ','ṷ','ụ','ủ','ư','ṹ','ṻ','ứ','ừ','ử','ữ','ự','ǘ','ū́','ǚ','u̇','u̇̄','ȕ','ū̀','ǜ','ų́','ų̃','ǖ','ȗ','ū̂','ū̃','u̱','ů́','ů̃','ũ̊','ū̊','ʉ'],
            'U' => ['Ú','Ů','Ù','Ü','Ű','Ū','Ų','Û','Ũ','Ǔ','Ŭ','Ṳ','Ṵ','Ṷ','Ụ','Ủ','Ư','Ṹ','Ṻ','Ứ','Ừ','Ử','Ữ','Ự','Ǘ','Ū́','Ǚ','U̇','U̇̄','Ȕ','Ū̀','Ǜ','Ų́','Ų̃','Ǖ','Ȗ','Ū̂','Ū̃','U̱','Ů́','Ů̃','Ũ̊','Ū̊','Ʉ'],
            'v' => ['ṽ','ṿ','v́','v̆','v̌','v̂','v̈','v̇','v̀','v̄','v̊','ʋ','ꝟ'],
            'V' => ['Ṽ','Ṿ','V́','V̆','V̌','V̂','V̈','V̇','V̀','V̄','V̊','Ʋ','Ꝟ'],
            'w' => ['ŵ','ẁ','ẃ','ẅ','ẇ','w̌','ẉ','w̄','ẘ','ⱳ'],
            'W' => ['Ŵ','Ẁ','Ẃ','Ẅ','Ẇ','W̌','Ẉ','W̄','W̊','Ⱳ'],
            'x' => ['ẋ','ẍ','x́','x̆','x̌','x̣','x̀','x̧','x̄','x̱','x̊'],
            'X' => ['Ẋ','Ẍ','X́','X̆','X̌','X̣','X̀','X̧','X̄','X̱','X̊'],
            'y' => ['ý','ŷ','ỳ','y̆','y̌','ỷ','ƴ','ȳ','ẏ','ẙ','ỹ','ÿ','y̓','y̱','ỵ','y̨','y̰','ÿ́','ɏ'],
            'Y' => ['Ý','Ŷ','Ỳ','Y̆','Y̌','Ỷ','Ƴ','Ȳ','Ẏ','Y̊','Ỹ','Ÿ','Y̓','Y̱','Ỵ','Y̨','Y̰','Ÿ́','Ɏ'],
            'z' => ['ž','ź','ż','ẑ','ẓ','ẕ','z̧','z̈','z̀','z̄','ƶ','ɀ'],
            'Z' => ['Ž','Ź','Ż','Ẑ','Ẓ','Ẕ','Z̧','Z̈','Z̀','Z̄','Ƶ','Ɀ']
        ];

        $transferTable = [];
        foreach ($letterVariants as $letter => $variants) {
            foreach ($variants as $variant) $transferTable[$variant] = $letter;
        }

        return strtr($str, $transferTable);
    }
}
